app/controllers/topics_controller.rb

INSERT INTO "topics" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Ruby"], ["description", "Ruby is an awesome language."], ["created_at", "2016-01-18 15:02:13.983081"], ["updated_at", "2016-01-18 15:02:13.983081"]]
---
  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save

UPDATE "topics" SET "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["description", "I still have a lot to learn on this topic."], ["updated_at", "2016-01-20 09:03:17.062615"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @topic.update(topic_params)

DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]
---
  def destroy
    @topic.destroy